# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [5,7, 9,13, 11,15]     #P2/4，增加的anchor
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head

head:
  [[-1, 1, Conv, [512, 1, 1]],  #10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #11
   [[-1, 6], 1, Concat, [1]],   #12
   [-1, 3, C3, [512, False]],     #13

   [-1, 1, Conv, [256, 1, 1]],    #14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #15
   [[-1, 4], 1, Concat, [1]],    #16

   [-1, 3, C3, [256, False]],       #17
   [-1, 1, Conv, [128, 1, 1]],      #18
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   #19
   [[-1, 2 ], 1, Concat, [1]],     #20
   [-1, 3, C3, [128, False]],       #21

   [-1, 1, Conv, [128, 3, 2]],      #22
   [[-1, 18 ], 1, Concat, [1]],    #23
   [-1, 3, C3, [ 256, False]],       #24
   [-1, 1, CoordAtt,[256]],                #25
   [-1, 1, Conv, [256, 3, 2]],      #26
   [[-1, 14 ], 1, Concat, [1]],    #27

   [-1, 3, C3, [512, False]],       #28
   [-1, 1, CoordAtt,[512]],                #29
   [-1, 1, Conv, [512, 3, 2]],      #30
   [[ -1, 10 ], 1, Concat, [1]],    #31
   [-1, 3, C3, [1024, False]],      #32
   [-1, 1, CoordAtt,[1024]],               #33
   [[21, 25, 29, 33], 1, Detect, [nc, anchors]], # 四个检测头，增加的为21
  ]
